p = ['̀', '́', '̂', '̃', '̄', '̅', '̆', '̇', '̈', '̉', '̊', '̋', '̌', '̍', '̎', '̏', '̐', '̑', '̒', '̓', '̔', '̕', '̖', '̗', '̘', '̙', '̚', '̛', '̜', '̝', '̞', '̟', '̠', '̡', '̢', '̣', '̤', '̥', '̦', '̧', '̨', '̩', '̪', '̫', '̬', '̭', '̮', '̯', '̰', '̱', '̲', '̳', '̴', '̵', '̶', '̷', '̸', '̹', '̺', '̻', '̼', '̽', '̾', '̿', '̀', '́', '͂', '̓', '̈́', 'ͅ', '͆', '͇', '͈', '͉', '͊', '͋', '͌', '͍', '͎', '͏', '͐', '͑', '͒', '͓', '͔', '͕', '͖', '͗', '͘', '͙', '͚', '͛', '͜', '͝', '͞', '͟', '͠', '͡', '͢', 'ͣ', 'ͤ', 'ͥ', 'ͦ', 'ͧ', 'ͨ', 'ͩ', 'ͪ', 'ͫ', 'ͬ', 'ͭ', 'ͮ', 'ͯ', 'ஂ', 'ஃ', 'ீ', '்', 'ఁ', 'ం', 'ః', 'ా', 'ి', 'ీ', 'ె', 'ే', 'ై', 'ొ', 'ో', 'ౌ', '్', 'ౕ', 'ౖ', 'ౢ', 'ౣ', 'ั', 'ิ', 'ี', 'ึ', 'ื', 'ุ', 'ู', 'ฺ', '็', '่', '้', '๊', '๋', '์', 'ํ', '๎', '༙', '༵', '༷', '༸', '༹', 'ཱ', 'ི', 'ཱི', 'ུ', 'ཱུ', 'ྲྀ', 'ཷ', 'ླྀ', 'ཹ', 'ེ', 'ཻ', 'ོ', 'ཽ', 'ཾ', 'ྀ', 'ཱྀ', 'ྂ', 'ྃ', '྄', '྆', '྇', 'ྍ', 'ྎ', 'ྏ', 'ྐ', 'ྑ', 'ྒ', 'ྒྷ', 'ྔ', 'ྕ', 'ྖ', 'ྗ', 'ྙ', 'ྚ', 'ྛ', 'ྜ', 'ྜྷ', 'ྞ', 'ྟ', 'ྠ', 'ྡ', 'ྡྷ', 'ྣ', 'ྤ', 'ྥ', 'ྦ', 'ྦྷ', 'ྨ', 'ྩ', 'ྪ', 'ྫ', 'ྫྷ', 'ྭ', 'ྮ', 'ྯ', 'ྰ', 'ྱ', 'ྲ', 'ླ', 'ྴ', 'ྵ', 'ྶ', 'ྷ', 'ྸ', 'ྐྵ', 'ྺ', 'ྻ', 'ྼ', '࿆', '⃐', '⃑', '⃒', '⃓', '⃔', '⃕', '⃖', '⃗', '⃘', '⃙', '⃚', '⃛', '⃜', '⃝', '⃞', '⃟', '⃠', '⃡', '⃢', '⃣', '⃤', '⃥', '⃦', '⃧', '⃨', '⃩', '⃪', '⃫', '⃬', '⃭', '⃮', '⃯', '⃰']

function Jia(str, level) {
    sz = [];
    pako.deflate(str, {
        level: level
    }).forEach(function(item, index, arr) {
        sz.push(p[item]);
    });
    return '自然经济：' + sz.join('')
};

function Jie(str) {
    if (str.indexOf("自然经济：") != 0) {
        return "不是自然经济捏😅";
    };
    var result = [];
    for (var i = 0; i < str.slice(5).length; i += 1) {
        result.push(p.indexOf(str.slice(i + 5, i + 6)));
    };
    return pako.inflate(result, {
        to: 'string'
    });
};
document.title = "自然经济"
level = 9

function Decode() {
    var jia = document.getElementById("jia"),
        jie = document.getElementById("jie");
    jia.value = Jie(jie.value), cleanTextAreaHeight(jia)

};

function Encode() {
    var jia = document.getElementById("jia"),
        jie = document.getElementById("jie");
    jie.value = Jia(jia.value, config.level), cleanTextAreaHeight(jie)

};